# KeyBasedTreeEntryError Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntryError Methods
KeyBasedTreeEntryError Class See Also
---
The KeyBasedTreeEntryError type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetEntry | Gets the entry for which an error occurred while building the KeyBasedTreeEntries object. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace